import stanford.karel.SuperKarel;

/*როგორც ნაჩვენებია სურათზე, კარელი თავდაპირველად იმყოფება სახლის მარცხენა ზედა კუთხეში. თქვენი ამოცანაა ააღებინოთ კარელს გაზეთი და დააბრუნოთ კარელი საწყის პოზიციაზე. გაზეთი, ისევე როგორც ყველა სხვა ობიექტი კარელის სამყაროში წარმოდგენილია ბრილიანტის სახით, რომელიც დევს სახლის გარეთ(იხ. სურათი).
ეს სავარჯიშო საკმაოდ მარტივია და მიზნად ისახავს კარელთან უკეთ გაცნობას. თქვენ შეგიძლიათ ჩათვალოთ რომ კარელის სამყარო გამოიყურება ზუსტად ისე როგორც სურათზეა ნაჩვენები. სახლი ყოველთვის ამ ზომისაა, კარის მდებარეობა ყოველთვის ისეთია როგორც სურათზე და ბრილიანტიც ზუსტად კარის წინ დევს.
თქვენი დავალებაა მხოლოდ დაწეროთ საჭირო ბრძანებების მიმდევრობა იმისათვის რომ კარელი
1. მივიდეს გაზეთთან,
2. აიღოს გაზეთი, და
3. დაბრუნდეს საწყის პოზიციაზე.

მიუხედავად იმისა რომ პროგრამა სულ რამოდენიმე ხაზს შეიცავს, სასურველია შეასულოთ გარკვეული დონის დეკომპოზიცია. კერძოთ, თქვენს პროგრამაში დაამატეთ თითო private მეთოდი თითოეული ბიჯისთვის, რომელიც ნაჩვენებია ზემოთ.
 */
public class assiment_1 extends SuperKarel{
	public void run(){
		goOut();
//		stand on 6x3 facing left
		pickBeeper();
		returnHome();
	}

	private void returnHome() {
		move();
		turnRight();
		move();
		turnLeft();
		doubleMove();
		turnAround();
	}

	private void goOut() {
		doubleMove();
		turnRight();
		move();
		turnLeft();
		move();
		turnAround();
	
		
	}

	private void doubleMove() {
		move();
		move();
		
	}
		
		
}